In [5]:
from models import *

In [6]:
ageRecongizer = vit_b_32_age_recognizer()

In [2]:
from loss import AgeRecognitionLoss
import torch

In [5]:
loss = AgeRecognitionLoss()
anchor = torch.rand(1, 512)
pos = torch.rand(1, 512)
neg = torch.rand(1, 512)
loss(anchor, pos, neg)

tensor(0.2857)

In [1]:
from preprocessor import AgeRecognitionPreprocessor

processor = AgeRecognitionPreprocessor()

In [4]:
processor.preprocess('./CACD2000/14_Aaron_Johnson_0001.jpg')

torch.Size([3, 224, 224])

In [42]:
import pandas as pd
import os 

df = pd.DataFrame(os.listdir('./CACD2000/'), columns=['image_name'])
split_names = df.image_name.apply(lambda x: x.split('_')).apply(lambda x: [x[0], ' '.join(x[1:-1]), x[-1]])
df['split_name'] = split_names
df = pd.DataFrame(df['split_name'].to_list(), columns=['age', 'name', 'image_id'])
df

       age           name  image_id
0       14  Aaron Johnson  0001.jpg
1       14  Aaron Johnson  0002.jpg
2       14  Adelaide Kane  0001.jpg
3       14  Adelaide Kane  0002.jpg
4       14  Adelaide Kane  0003.jpg
...     ..            ...       ...
163441  62   William Katt  0008.jpg
163442  62   William Katt  0009.jpg
163443  62   William Katt  0011.jpg
163444  62   William Katt  0013.jpg
163445  62   William Katt  0014.jpg

[163446 rows x 3 columns]

In [46]:
df.groupby('age').agg('count')

     name  image_id
age
14    284       284
15    624       624
16   1012      1012
17   1322      1322
18   1706      1706
19   2109      2109
20   2590      2590
21   3091      3091
22   3685      3685
23   4099      4099
24   4241      4241
25   4266      4266
26   4214      4214
27   4233      4233
28   4283      4283
29   4367      4367
30   4271      4271
31   4315      4315
32   4243      4243
33   4334      4334
34   4335      4335
35   4364      4364
36   4323      4323
37   4397      4397
38   4258      4258
39   4264      4264
40   4343      4343
41   4269      4269
42   4160      4160
43   4080      4080
44   4130      4130
45   3929      3929
46   3949      3949
47   3829      3829
48   3860      3860
49   3795      3795
50   3818      3818
51   3788      3788
52   3741      3741
53   3647      3647
54   3400      3400
55   3159      3159
56   2814      2814
57   2529      2529
58   2200      2200
59   1864      1864
60   1349      1349
61   1034      1034
62    529       529